
## Plan Result




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_insights.rota_dtu_app_insights
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-instrumentation-key&#34;]
* Update
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.rota_dtu_app_insights will be created
  + resource "azurerm_application_insights" "rota_dtu_app_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "java"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "hmi-rota-dtu-stg"
      + resource_group_name                   = "hmi-sharedinfra-stg-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-rota-dtu-instrumentation-key"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "app-insights-rota-dtu-instrumentation-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "App Insights"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                       = "hmi-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Vars":{}} -->